-- ============================================================
-- Домашнее задание к лекции «SQL. Введение»
-- Школа Аналитиков · учебная база hh_school
-- Автор: Новиков Григорий Андреевич
-- ============================================================
-- Формат: задания по порядку, каждое начинается с комментария
-- с номером; под каждым запросом — вывод (2–3 предложения).
-- Запрос без вывода не засчитывается.
-- ============================================================

SET search_path TO hh_school;


-- ============================================================
-- БЛОК А. Разминка: термины и структура (текстом)
-- ============================================================

-- ЗАДАНИЕ А1
-- 1. Категория и конкретный тип колонок:
--    vacancies.salary_from        — категория: числовой   тип: integer
--    vacancies.vacancy_name       — категория: строковый   тип: text
--    vacancies.published_at       — категория: дата и время   тип: timestamp
--    employers.is_accredited_it   — категория: логический   тип: boolean
--    responses.created_at         — категория: дата и время   тип: timestamp
--
-- 2. Первичные ключи таблиц:
--    areas: area_id
--    employers: employer_id
--    vacancies: vacancy_id
--    vacancy_details: vacancy_id (чем особенный: имеет такое же имя как и ПК vacancies. Использована связь 1:1 чтобы вынести объемное описание каждой вакансии.)
--    responses: response_id
--
-- 3. Почему vacancy_name не может быть первичным ключом:
--    Первичный ключ должен быть уникальным(ну и не пустым конечно). Ведь он однозначно идентифицирует запись в таблице.
--	  Значения поля vacancy_name не уникальны и повторяются, поэтому мы не можем использовать это поле как ПК.
--    Запрос для подтверждения числом:

-- запрос:
SELECT vacancy_name, count(*) AS cnt
FROM vacancies
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1

-- Вывод:
-- Самое частое название вакансии - Стажер: аналитик данных.
-- Оно встречается 6 раз. (именно поэтому мы не можем использовать поле vacancy_name как ПК)

-- 4. Что произойдёт при записи строки «по договорённости» в salary_from:
--    Тип данных поля salary_from это integer(числовой). А мы пытаемся записать текст.
--    СУБД нам выдаст ошибку. Потому что тип поля не соотвествует типу данных которые мы за записали в ячейку.
--    Такое поведение СУБД удобно т.к. мы сразу видим ошибки и несостыковки в базе данных и можем это исправить. 

-- ============================================================
-- БЛОК Б. Первые запросы: SELECT, WHERE, ORDER BY
-- ============================================================

-- ЗАДАНИЕ Б1
-- Запрос: experience
SELECT DISTINCT experience
FROM vacancies

-- Запрос: employment
SELECT DISTINCT employment
FROM vacancies

-- Запрос: professional_role
SELECT DISTINCT professional_role
FROM vacancies

-- Вывод:
-- В колонке experience 3 различных значения. В employment - 3. В professional_role - 5.
-- Признаков проблем с качеством данных нет. Нет одних и тех же значений записанных по-разному и нет неожиданных NULL.


-- ЗАДАНИЕ Б2
-- Запрос 1: стажировки в Москве без опыта, вакансия открыта
SELECT v.vacancy_id, v.vacancy_name, v.salary_from, v.published_at
FROM vacancies v
INNER JOIN areas a ON v.area_id = a.area_id
WHERE v.employment = 'Стажировка' AND a.area_name = 'Москва' AND v.experience = 'Нет опыта' AND v.closed_at IS NULL 
ORDER BY v.published_at DESC 

-- Запрос 2: топ-10 вакансий по salary_from
SELECT vacancy_name, professional_role, salary_from
FROM vacancies
ORDER BY salary_from DESC NULLS LAST 
LIMIT 10

-- Вывод:
-- Первый запрос нашел 8 вакансий.
-- Если убрать условие про Москву - поиск будет идти по всем городам и в итоге выведет больше вакансий.


-- ЗАДАНИЕ Б3
-- Ловушка 1. NULL — выполнить и объяснить результат
SELECT count(*) FROM vacancies WHERE closed_at = NULL;
SELECT count(*) FROM vacancies WHERE closed_at IS NULL;

-- Ловушка 2. AND / OR — выполнить и объяснить результат
SELECT count(*) FROM vacancies
WHERE area_id = 1 OR area_id = 2 AND experience = 'Нет опыта';

SELECT count(*) FROM vacancies
WHERE (area_id = 1 OR area_id = 2) AND experience = 'Нет опыта';

-- Вывод:
-- Первый запрос про NULL не выдал ошибку, а вернул конкретное число потому что сравнение c NULL не истинно и не ложно.
-- Соответственно условие не выполнилось ни один раз и выдало результат - 0. Это опаснее ошибки т.к. мы можем подумать,
-- что условие выполнилось и его результат 0. Но на самом деле это заблуждение и может в последующем привести к неправильным выводам.
-- NULL в колонке closed_at означает что вакансия еще открыта.(т.к. дата ее закрытия отсутствует)
--
-- Первое условие во второй паре база прочитала как area_id = 1 OR (area_id = 2 AND experience = 'Нет опыта').
-- Можно провести аналогию со сложением и умножением. То есть AND выполнилось первым. А потом "Прибавляем" с помощью OR.
-- На вопрос «вакансии из Москвы или Санкт-Петербурга, но обязательно без опыта» отвечает второй запрос из второй пары.
-- То есть сначала мы должны убедиться что вакансия из Москвы OR Питера и потом дополнительно требуем "Нет опыта"
-- ============================================================
-- БЛОК В. Агрегации и метрики
-- ============================================================

-- ЗАДАНИЕ В1
-- Запрос 1: счётчики (строки, зарплата указана, направления, работодатели)
SELECT count(*) salary_from, count(salary_from), count(DISTINCT professional_role), count(DISTINCT employer_id)
FROM vacancies
-- Запрос 2: доля активных вакансий (без JOIN)
SELECT count(vacancy_id) FILTER (WHERE closed_at IS NULL) AS vcn_open,
	count(vacancy_id) FILTER (WHERE closed_at IS NOT NULL) AS vcn_close,
	round((100.0 * count(vacancy_id) FILTER (WHERE closed_at IS NULL)) / nullif(count(vacancy_id), 0), 1)
FROM vacancies

-- Вывод:
-- count(*) считает все значение в колонке(в том числе повторяющиеся и NULL)
-- count(колонка) считает все значения в колонке без NULL(в том числе повторяющиеся но не учитывает ячейки с NULL)
-- на примере запроса: count(*) salary_from вывело 52, count(salary_from) вывело 44. Значит 8 строк имели значение NULL в поле salary_from
-- то есть 8 ваканский были без указанной нижней границы зарплаты.
-- count(DISTINCT колонка) считает только уникальные значения в колонке(если есть повторяющиеся - посчитает только 1 раз, NULL не считает)
-- если использовать count(DISTINCT колонка) вместо count(колонка) значений будет либо столько же либо меньше, т.к. исключили повторы.
--
-- ответ руководителю: У нас сейчас активны 33 вакансии или 63.5% от общего числа вакансий. 


-- ЗАДАНИЕ В2
-- Запрос 1: направления — вакансии, работодатели, средняя зарплата
SELECT professional_role, count(*) AS cnt, count(DISTINCT employer_id), round(avg(salary_from), 0)
FROM vacancies
GROUP BY professional_role 
ORDER BY cnt DESC 

-- Запрос 2: то же, только направления с ≥ 5 открытыми вакансиями (WHERE + HAVING)
SELECT professional_role, count(*) AS cnt, count(DISTINCT employer_id), round(avg(salary_from), 0)
FROM vacancies
WHERE closed_at IS NULL 
GROUP BY professional_role 
HAVING count(*) >= 5
ORDER BY cnt DESC 

-- Вывод:
-- Аналитик данных и разработчик занимают больше половины рынка учебной базы.
-- Глядя только на эту таблицу соискатель мог бы сделать вывод что по этим двум основным направлениям больше перпектив устроиться
-- и шансы на оффер там выше. Но для такого вывода не хватает информации об откликах и конверсии в приглашение.
-- Условие «только открытые вакансии» пишется в WHERE, т.к. с помощью WHERE мы фильтруем строки до группировки. Чтобы наша выборка
-- для дальнейших преобразований состояла только из открытых вакансий. А когда мы уже сформировали группы, мы ставим условие «не менее пяти» 
-- в HAVING чтобы отсеять неподходящие группы(в данном случае по количеству открытых вакансий)
-- Если попытаться написать WHERE count(*) >= 5; нам выдаст ошибку. Т.к. еще не была выполнена группировка и count(*) не рассчиталось.
-- Полученное значение avg(salary_from) отвечает на вопрос: "Какая средняя нижняя граница зарплаты у каждого направления?"
-- Но при этом не отвечает на вопрос: "Какая средняя зарплата у специалистов каждого направления?".
-- То есть ответ на первый вопрос не отражает реальную ситуацию на рынке по зарплатам специалистов, а второй отвечает.


-- ============================================================
-- БЛОК Г. Соединение таблиц
-- ============================================================

-- ЗАДАНИЕ Г1
-- Запрос: топ-5 по salary_from с названием компании и городом (псевдонимы таблиц)
SELECT v.vacancy_name, e.employer_name, a.area_name, v.salary_from
FROM vacancies v
LEFT JOIN employers e ON v.employer_id = e.employer_id
LEFT JOIN areas a ON v.area_id = a.area_id
ORDER BY v.salary_from DESC NULLS LAST 
LIMIT 5
-- Вывод:
-- Если убрать псевдонимы и написать просто area_id выйдет ошибка. Т.к. поле area_id есть в трех таблицах: vacancies, employers и areas.
-- И без псевдонимов СУБД не сможет определить из какой именно таблицы брать данные.
--


-- ЗАДАНИЕ Г2
-- Запрос 1: все работодатели, число вакансий и откликов (LEFT JOIN)
SELECT e.employer_name, count(DISTINCT v.vacancy_id) AS vcn, count(r.response_id) AS rsp
FROM employers e
LEFT JOIN vacancies v ON e.employer_id = v.employer_id
LEFT JOIN responses r ON v.vacancy_id = r.vacancy_id
GROUP BY e.employer_name
ORDER BY rsp DESC 

-- Запрос 2: тот же запрос с INNER JOIN
SELECT e.employer_name, count(DISTINCT v.vacancy_id) AS vcn, count(r.response_id) AS rsp
FROM employers e
INNER JOIN vacancies v ON e.employer_id = v.employer_id
INNER JOIN responses r ON v.vacancy_id = r.vacancy_id
GROUP BY e.employer_name
ORDER BY rsp DESC

-- Вывод:
-- Количество вакансий приходится считать через count(DISTINCT ...), а не через count(*) т.к. когда мы присоединяем таблицу repsonses у нас
-- на каждую вакансию приходится много отликов из за чего один и тот же id вакансии начинает дублироваться, хотя по сути это одна вакансия.
-- Во втором запросе исчезла компания ГринЭнерго. Это содержательная потеря т.к. в задании сказано вывести всех работодателей и информацию
-- связанную с ними, даже тех, у которых откликов 0. Но INNER JOIN отбросила этого работодателя.
--
-- INNER JOIN я буду использовать когда мне нужны строки с совпадениями в обоих таблицах. А LEFT JOIN буду использовать если для меня
-- по каким то важными причинам важно сохранить все строки исходной таблицы даже несмотря на то что присоединенные поля могут оставаться
-- пустыми.


-- ============================================================
-- БЛОК Д. Функции и финальный кейс
-- ============================================================

-- ЗАДАНИЕ Д1
-- Запрос: помесячная динамика откликов и конверсия
-- (месяц как дата, условный агрегат, nullif в знаменателе)

SELECT date_trunc('month', created_at)::date AS mnth, count(response_id) AS cnt, 
	count(response_id) FILTER (WHERE status = 'invited') AS inv,
	round(100.0 * count(response_id) FILTER (WHERE status = 'invited') / nullif(count(response_id), 0), 1) AS ctr
FROM responses
GROUP BY 1
ORDER BY 1
-- Вывод:
-- Максимальная конверсия в июне - 19.5%
-- Этому месяцу доверять можно :) Т.к. объем данных в нем достаточно большой относительно других месяцев в выборке(118 откликов).
-- Последний месяц в таблице(август) имеет всего 41 отклик что по сравнению с прошлым месяцем(142 отклика) крайне мало.
-- Вероятно, данные за август неполные, поэтому мы получили такой результат. В таком случае его лучше исключить из выводов, т.к. он будет
-- искажать картину.


-- ЗАДАНИЕ Д2
-- Запрос: таблица по направлениям (вакансии, отклики, приглашения,
-- откликов на вакансию, конверсия)
SELECT v.professional_role, 
	count(DISTINCT v.vacancy_id) AS vcn,
	count(r.response_id) AS rsp,
	count(r.response_id) FILTER (WHERE r.status = 'invited') AS inv,
	round(count(r.response_id) * 1.0 / nullif(count(DISTINCT v.vacancy_id), 0), 2) AS avg,
	round(100.0 * count(r.response_id) FILTER (WHERE r.status = 'invited') / nullif(count(r.response_id), 0), 2) AS ctr
FROM vacancies v
LEFT JOIN responses r ON v.vacancy_id = r.vacancy_id
GROUP BY v.professional_role

-- Письменные ответы:
-- 1. Совпадает ли направление с наибольшим числом вакансий с направлением
--    с наибольшей конверсией?
-- Нет. Направление с наибольшим числом вакансий (16) - Аналитик данных.
-- Но при этом направление с наибольшей конверсией (35.9 %) - Тестировщик.
-- 2. Какое направление выбрать и почему (опираясь на два столбца):
-- Для отклика я бы выбрал направление Разработчик. Т.к. данное направление практически самое большое количество вакансий по сравнению
-- с другими направлениями а также конверсия в приглашения больше чем у большинства направлений.
-- 3. Оговорка к выводу:
-- Нужно учитывать то какие навыки и скиллы необходимо иметь чтобы пройти по этому направления. Данные таблицы этого не говорят.
-- Также в расчете среднего домножил на 1.0 т.к. иначе делится целочисленно и отбрасывается дробная часть. 
--Я думаю все таки дробную часть следует оставить.

-- ============================================================
-- БЛОК Е. Со звёздочкой
-- ============================================================

-- ЗАДАНИЕ Е1
-- Исходный запрос (выполнить и посмотреть результат):
SELECT v.professional_role,
count(*) AS vacancies,
sum(v.salary_from) AS total_salary,
count(r.response_id) / count(*) AS responses_per_vacancy
FROM vacancies v
JOIN responses r ON v.vacancy_id = r.vacancy_id
WHERE v.closed_at = NULL
GROUP BY 1;
--
-- Ошибки (минимум четыре):
-- 1. Когда хотим найти ячейки с NULL надо использовать is. Было использовано "=" поэтому не вывелось ни одной строки.
-- 2. когда счиитаем вакансии надо сделать count(distinct v.vacancy_id) т.к. после агрегации на одну вакансию приходится много откликов
-- Таким образом вакансия дублируется несколько раз.
-- 3. В расчете responses per vacancy тоже нужно считать вакансии через дистинкт а также проверять знаменатель на значение 0.
-- 4. Также желательно вместо JOIN (по умолчанию INNER JOIN) использовать LEFT JOIN чтобы не терять вакансии без откликов.
-- 5. Зарплаты считаются дублированные из за присоединения откликов. Но я что-то не понимаю как это исправить
-- чтобы они считались один раз :)
--
-- Исправленный запрос:
SELECT v.professional_role,
count(DISTINCT v.vacancy_id) AS vacancies,
sum(v.salary_from) AS total_salary,
count(r.response_id) / NULLIF(count(DISTINCT v.vacancy_id), 0) AS responses_per_vacancy
FROM vacancies v
LEFT JOIN responses r ON v.vacancy_id = r.vacancy_id
WHERE v.closed_at is NULL
GROUP BY 1;

-- Какие два правила из лекции защитили бы от этих ошибок при написании запроса:
-- 1. Конечно же помнить как следует работать с NULL. Что проверка на NULL происходит только с помошью IS.
-- А также что только count(*) учитывает NULL. Еще во избежание ошибок всегда nullif использовать для знаменателя при делении.
-- 2. Корректно соединять таблицы и понимать как это происходит и как реализуется связь. 
-- То есть вот на примерах при присоединении таблицы откликов каждая вакансия дублировалась для каждого отдельного
-- отклика(связь 1 : N) и для такого случая чтобы считать вакансии надо уже применять DISTINCT. Также важно что JOIN по умолчанию это INNER JOIN 
--и часть данных может автоматически "молча" теряться. При этом если нужно сохранить данные исходной таблицы даже если нет совпадений 
--в присоединенной необходимо явно прописывать LEFT JOIN.

